Rating/Sample/AB/newSample.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://wsc.tdigi/calculatepremium/calculateautopremium/request/v4">
	<soapenv:Header/>
	<soapenv:Body>
		<v4:calculateAutoPremium>
			<CalculateAutoPremiumRequest>
				<AutomobilePolicy>
					<PortfolioNumber/>
					<ContractNumber/>
					<EffectiveDate/>
					<IsAutomaticRating/>
					<IsOriginalContract/>
					<EndDate/>
					<RatingSource/>
					<Insurer>
						<InsurerName/>
						<InsurerNumber/>
					</Insurer>
					<LineOfBusiness/>
					<VersionEffectiveDate/>
					<RateDate/>
					<ClientGroupNumber/>
					<RatingGroupNumber/>
					<TransactionType/>
					<Address>
						<DisplayPostalZipCode/>
						<DisplayProvinceState/>
					</Address>
					<AutomobilePolicyCounters>
					</AutomobilePolicyCounters>
					<Coverages/>
					<Vehicles/>
					<VehicleDriverUsages>
						<VehicleDriverUsage>
							<AnnualMileage/>
							<BusinessMileage/>
							<WorkMileage/>
							<DriverNumber/>
							<VehicleNumber/>
							<Risk>
								<RateDate/>
								<Territory>
								</Territory>
								<Coverages/>
								<DiscountSurcharges>
								</DiscountSurcharges>
							</Risk>
							<UBIVehicleDriverDiscount>
							</UBIVehicleDriverDiscount>
							<CurrentVehicleUsageType/>
						</VehicleDriverUsage>
					</VehicleDriverUsages>
					<DriverInformations>
					</DriverInformations>
					<DriverVehicleList>
					</DriverVehicleList>					
					<LocationList/>
					<Territory>
					</Territory>
				</AutomobilePolicy>
			</CalculateAutoPremiumRequest>
			<EnvironmentIdentification>
				<EnvironmentID/>
			</EnvironmentIdentification>
		</v4:calculateAutoPremium>
	</soapenv:Body>
</soapenv:Envelope>